samples/ITI-45_response_raw.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <wsa:Action xmlns:mustUnderstand="http://www.w3.org/2003/05/soap-envelope" mustUnderstand:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201310UV02</wsa:Action>
    <wsa:RelatesTo>urn:uuid:c12e1f14-c2c9-4a94-ba27-6411e8c90b75</wsa:RelatesTo>
  </soapenv:Header>
  <soapenv:Body>
    <ns1:PRPA_IN201310UV02 xmlns:ns1="urn:hl7-org:v3" ITSVersion="XML_1.0">
      <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="30" root="1.2.3.4.5" xsi:type="ns1:II"/>
      <ns1:creationTime xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" value="20230912151951" xsi:type="ns1:TS"/>
      <ns1:versionCode code="V3PR1"/>
      <ns1:interactionId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="PRPA_IN201310UV02" root="2.16.840.1.113883" xsi:type="ns1:II"/>
      <ns1:processingCode code="P"/>
      <ns1:processingModeCode code="T"/>
      <ns1:acceptAckCode code="NE"/>
      <ns1:receiver typeCode="RCV">
        <ns1:device classCode="DEV" determinerCode="INSTANCE">
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="1.3.6.1.4.1.21367.2017.2.2.140" xsi:type="ns1:II"/>
          <ns1:asAgent classCode="AGNT">
            <ns1:representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="1.3.6.1.4.1.21367.2017.2.2.140" xsi:type="ns1:II"/>
            </ns1:representedOrganization>
          </ns1:asAgent>
        </ns1:device>
      </ns1:receiver>
      <ns1:sender typeCode="SND">
        <ns1:device classCode="DEV" determinerCode="INSTANCE">
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="1.3.6.1.4.1.21367.2017.2.4.136" xsi:type="ns1:II"/>
          <ns1:asAgent classCode="AGNT">
            <ns1:representedOrganization classCode="ORG" determinerCode="INSTANCE">
              <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="1.3.6.1.4.1.21367.2017.2.4.136" xsi:type="ns1:II"/>
            </ns1:representedOrganization>
          </ns1:asAgent>
        </ns1:device>
      </ns1:sender>
      <ns1:acknowledgement>
        <ns1:typeCode code="AA"/>
        <ns1:targetMessage>
          <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="1694523036420" root="1.3.6.1.4.1.21367.2017.2.7.141" xsi:type="ns1:II"/>
        </ns1:targetMessage>
      </ns1:acknowledgement>
      <ns1:controlActProcess classCode="CACT" moodCode="EVN">
        <ns1:code xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="PRPA_TE201310UV02" xsi:type="ns1:CD"/>
        <ns1:subject typeCode="SUBJ">
          <ns1:registrationEvent classCode="REG" moodCode="EVN">
            <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" nullFlavor="NA" xsi:type="ns1:II"/>
            <ns1:statusCode code="active"/>
            <ns1:subject1 typeCode="SBJ">
              <ns1:patient classCode="PAT">
                <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" assigningAuthorityName="XDS Affinity Domain" extension="7f2e05e6-673e-44b6-8b76-e17ac58ea80f" root="1.3.6.1.4.1.21367.2017.2.5.93" xsi:type="ns1:II"/>
                <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" assigningAuthorityName="SPID" extension="761337610435209810" root="2.16.756.5.30.1.127.3.10.3" xsi:type="ns1:II"/>
                <ns1:statusCode code="active"/>
                <ns1:patientPerson classCode="PSN" determinerCode="INSTANCE">
                  <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" nullFlavor="NA" xsi:type="ns1:PN"/>
                </ns1:patientPerson>
              </ns1:patient>
            </ns1:subject1>
            <ns1:custodian typeCode="CST">
              <ns1:assignedEntity classCode="ASSIGNED">
                <ns1:id xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="MyOrgID" root="1.3.6.1.4.1.21367.2010.1.2.600" xsi:type="ns1:II"/>
                <ns1:assignedOrganization classCode="ORG" determinerCode="INSTANCE">
                  <ns1:name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:EN">
                    <ns1:given>MyOrganisation</ns1:given>
                  </ns1:name>
                </ns1:assignedOrganization>
              </ns1:assignedEntity>
            </ns1:custodian>
          </ns1:registrationEvent>
        </ns1:subject>
        <ns1:queryAck>
          <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="1694523036421" root="1.3.6.1.4.1.21367.2017.2.7.141" xsi:type="ns1:II"/>
          <ns1:statusCode code="deliveredResponse"/>
          <ns1:queryResponseCode code="OK"/>
        </ns1:queryAck>
        <ns1:queryByParameter>
          <ns1:queryId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="1694523036421" root="1.3.6.1.4.1.21367.2017.2.7.141" xsi:type="ns1:II"/>
          <ns1:statusCode code="new"/>
          <ns1:responsePriorityCode code="I"/>
          <ns1:parameterList>
            <ns1:dataSource>
              <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="1.3.6.1.4.1.21367.2017.2.5.93" xsi:type="ns1:II"/>
              <ns1:semanticsText>DataSource.id</ns1:semanticsText>
            </ns1:dataSource>
            <ns1:dataSource>
              <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" root="2.16.756.5.30.1.127.3.10.3" xsi:type="ns1:II"/>
              <ns1:semanticsText>DataSource.id</ns1:semanticsText>
            </ns1:dataSource>
            <ns1:patientIdentifier>
              <ns1:value xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" extension="900010" root="1.3.6.1.4.1.21367.2017.2.5.103" xsi:type="ns1:II"/>
              <ns1:semanticsText>Patient.id</ns1:semanticsText>
            </ns1:patientIdentifier>
          </ns1:parameterList>
        </ns1:queryByParameter>
      </ns1:controlActProcess>
    </ns1:PRPA_IN201310UV02>
  </soapenv:Body>
</soapenv:Envelope>
