samples/ITI-45_request_raw.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
 <env:Header>
  <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">
   https://epd-test.ith-icoserve.com:7443/PIXPDQ/services/PIXPDQV3ManagerService
  </wsa:To>
  <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:c12e1f14-c2c9-4a94-ba27-6411e8c90b75</wsa:MessageID>
  <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:ReplyTo>
  <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" env:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201309UV02</wsa:Action>
 </env:Header>
 <env:Body>
  <PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0">
   <id root="1.3.6.1.4.1.21367.2017.2.5.55"/>
   <creationTime value="20200921170501.122"/>
   <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.6"/>
   <processingCode code="P"/>
   <processingModeCode code="T"/>
   <acceptAckCode code="AL"/>
   <receiver typeCode="RCV">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.3.6.1.4.1.21367.2017.2.4.105"/>
    </device>
   </receiver>
   <sender typeCode="SND">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.3.6.1.4.1.21367.2017.2.5.55"/>
    </device>
   </sender>
   <controlActProcess classCode="CACT" moodCode="EVN">
    <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
    <authorOrPerformer typeCode="AUT">
     <assignedPerson classCode="ASSIGNED">
      <id extension="client application" root="1.3.6.1.4.1.24930"/>
     </assignedPerson>
    </authorOrPerformer>
    <queryByParameter>
     <queryId root="4ecd362e-8d17-4abe-b991-3793bc2e1399"/>
     <statusCode code="new"/>
     <responsePriorityCode code="I"/>
     <parameterList>
      <dataSource>
       <value root="1.3.6.1.4.1.21367.2017.2.5.45"/>
       <semanticsText>DataSource.id</semanticsText>
      </dataSource>
      <patientIdentifier>
       <value extension="CHFACILITY9810" root="1.3.6.1.4.1.12559.11.25.1.19"/>
       <semanticsText>Patient.Id</semanticsText>
      </patientIdentifier>
     </parameterList>
    </queryByParameter>
   </controlActProcess>
  </PRPA_IN201309UV02>
 </env:Body>
</env:Envelope>
