app/controllers/PIXHealthShareRequestSoapEnv.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://serviceimpl.pixpdq.services.hieos.vangent.com">
  <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>urn:hl7-org:v3:PRPA_IN201309UV02</wsa:Action><wsa:MessageID>uuid:a2f71d32-98d7-4116-9ea3-66096aee1c21</wsa:MessageID><wsa:To>http://172.16.12.82:37080/axis2/services/pixmgr</wsa:To></soap:Header>
  <soap:Body>
    <PRPA_IN201309UV02 ITSVersion="XML_1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">
      <id root="2220c1c4-87ef-11dc-b865-3603d6866807"/>
      <creationTime value="20070810140900"/>
      <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201309UV02"/>
      <processingCode code="P"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.2.840.114350.1.13.99999.4567"/>
          <telecom value="https://example.org/PIXQuery"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.2.840.114350.1.13.99997.2.7788"/>
        </device>
      </sender>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
          <assignedPerson classCode="ASSIGNED">
            <id root="1.2.840.114350.1.13.99997.2.7766" extension="1.3.6.1.4.1.21367.13.20.1000"/>
          </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
          <queryId root="1.2.840.114350.1.13.99999.4567.34" extension="33452"/>
          <statusCode code="new"/>
          <responsePriorityCode code="I"/>
          <parameterList>
            <!-- could have multiple data sources -->
            <!--
                    <dataSource>
                       <value root="1.3.6.1.4.1.21367.2005.1.1"/>
                       <semanticsText>DataSource.Id</semanticsText>
                    </dataSource>
                    <dataSource>
                       <value root="1.3.6.1.4.1.21367.2005.1.2"/>
                       <semanticsText>DataSource.Id</semanticsText>
                    </dataSource> -->
            <!--<dataSource>
                       <value root="1.3.6.1.4.1.21367.13.20.999"/>
                       <semanticsText>DataSource.Id</semanticsText>
                    </dataSource>-->

            <!-- 1.3.6.1.4.1.21367.13.20.1000 -->
            <patientIdentifier>

              <!-- Placeholder for our edipi request values -->

              <semanticsText>Patient.Id</semanticsText>
            </patientIdentifier>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </PRPA_IN201309UV02>
  </soap:Body>
</soap:Envelope>