app/controllers/PIXHealthShareResponseSoapEnv.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <SOAP-ENV:Header>
      <wsa:Action>urn:hl7-org:v3:PRPA_IN201310UV02</wsa:Action>
      <wsa:MessageID>urn:uuid:9DE3B545-E80B-47D5-84F2-B26A15512963</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:ReplyTo>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <PRPA_IN201310UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3">
         <id root="7372662C-176B-47CF-BFB5-0191CB4E0BF2"/>
         <creationTime value="20130726135418-1000"/>
         <interactionId extension="PRPA_IN201310UV02" root="2.16.840.1.113883.1.6"/>
         <processingCode code="P"/>
         <processingModeCode code="T"/>
         <acceptAckCode code="NE"/>
         <hl7:receiver typeCode="RCV" xmlns:hl7="urn:hl7-org:v3">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.2.840.114350.1.13.99997.2.7788"/>
            </device>
         </hl7:receiver>
         <hl7:sender typeCode="SND" xmlns:hl7="urn:hl7-org:v3">
            <device classCode="DEV" determinerCode="INSTANCE">
               <id root="1.2.840.114350.1.13.99999.4567"/>
               <telecom value="https://example.org/PIXQuery"/>
            </device>
         </hl7:sender>
         <acknowledgement>
            <typeCode code="AA"/>
            <targetMessage>
               <id root="2220c1c4-87ef-11dc-b865-3603d6866807"/>
            </targetMessage>
         </acknowledgement>
         <controlActProcess classCode="CACT" moodCode="EVN">
            <code code="PRPA_TE201310UV02"/>
            <subject typeCode="SUBJ">
               <registrationEvent classCode="REG" moodCode="EVN">
                  <id nullFlavor="NA"/>
                  <statusCode code="active"/>
                  <subject1 typeCode="SBJ">
                     <patient classCode="PAT">
                        <id extension="1000000138" root="1.3.6.1.4.1.21367.2010.1.2.300.2.8"/>
                        <id extension="100000049" root="1.3.6.1.4.1.21367.2010.1.2.300"/>
                        <statusCode code="active"/>
                        <patientPerson classCode="PSN" determinerCode="INSTANCE">
                           <name>
                              <given>TEST</given>
                              <family>HALL</family>
                           </name>
                        </patientPerson>
                     </patient>
                  </subject1>
                  <custodian typeCode="CST">
                     <assignedEntity classCode="ASSIGNED">
                        <id root="1.3.6.1.4.1.21367.2010.1.2.300"/>
                        <assignedOrganization classCode="ORG" determinerCode="INSTANCE">
                           <name>Home Community</name>
                        </assignedOrganization>
                     </assignedEntity>
                  </custodian>
               </registrationEvent>
            </subject>
            <queryAck>
               <queryId extension="33452" root="1.2.840.114350.1.13.99999.4567.34"/>
               <queryResponseCode code="OK"/>
            </queryAck>
            <queryByParameter>
               <queryId extension="33452" root="1.2.840.114350.1.13.99999.4567.34"/>
               <statusCode code="new"/>
               <responsePriorityCode code="I"/>
               <parameterList>
                  <patientIdentifier>
                     <value extension="1000000138"/>
                     <semanticsText>Patient.Id</semanticsText>
                  </patientIdentifier>
               </parameterList>
            </queryByParameter>
         </controlActProcess>
      </PRPA_IN201310UV02>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>